Autodesk.Revit.UI.Mechanical.DuctFittingAndAccessoryPressureDropUIDataItem.SetEntity(Autodesk.Revit.DB.ExtensibleStorage.Entity)
Stores the entity in the UI data item.
entity:
The Entity to be stored.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Writing of Entities of this Schema is not allowed to the current add-in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014